////////вычислить F(x,y)
#include <iostream>  //библиотека дл€ потока ввода-вывода
#include <cmath> //библиотека математических функций
using namespace std; //директива

int main() //оператор 1
{
	setlocale(LC_ALL, "RUS");  //использование русской клавиатуры
	double x, y;//ввод двух переменных
	cout << "¬ведите х у, через пробел\n ";//вывод результатов
	cin >> x >> y;
	double c = 1.0 * x * y + ((sqrt(exp(x - 1) + exp(y - 1))) / pow(cos(x + 2 * y), 2)) / 5;//формула дл€ вычислени€ 
	cout << "F(x,y) равна:" << c << endl;//вывод результатов
	system("pause"); //задержка консоли
	return 0; //оператор 2 
}