#include <iostream>//библиотека дл€ потока ввода-вывода
#include <time.h>//библиотека дл€ рандомных чисел
#include <stdio.h>//библиотека дл€ различных операций
#include <stdlib.h>//библиотека дл€ выделени€ пам€ти

using namespace std;//директива стд

int main()//оператор 1
{

	setlocale(LC_ALL, "RUS"); //использование русской клавиатуры
	int N, C, A;//объ€вл€ем переменную 
	cout << "¬ведите N: ";//вывод
	cin >> N;//ввод
	int *a = new int [N];//удел€ем место дл€ массива
	srand ((unsigned)time(NULL));//рандомное число
	for (int i = 0; i < N; i++) //цикл дл€ вы€влени€ числа 
	{
		a[i] = rand() % 15;//подбор чисел 
		cout << a[i] << " ";//вывод массивов
	}
	cout << endl;//нова€ строка 

	if (N % 2 == 0)// если число четное
	{
		A = N / 2 - 1;//находим середину
		C = a[A+1];//ѕрисваиваем 
		a[A + 1] = a[A];//«амен€ем 
		a[A] = C;//замен€ем другой на первый
		for (int B = 0; B < N; B++)//цикл 
		{
			cout << a[B] << " ";//вывод
		
		}
	}																

	if (N % 2 != 0)// поиск на нечетность
	{
		A = (N - 1) / 2;//ищим элементы
		C = a[A];//присваиваем 
		a[A] = a[0];//«амен€ем
		a[0] = C;//замен€ем другой на первый 
		for(int G = 0; G < N; G++)//цикл
		{
			cout << a[G] << " ";//вывод

		}
	}

	cout << endl;//нова€ строка 

	system("pause");//задержка консоли
	return 0;//оператор 2
}












