#include <iostream>
#include <cmath>
using namespace std;

int main()//оператор 1
{
	setlocale(LC_ALL, "rus");//использование русской клавиатуры
	float A1, B1, C1, D1, A2, B2, C2, D2, z0;// вводим переменные 
	cout << "Введите координаты первой плоскости" << endl;;//вывод первой плоскости
	cout << "A1" << endl;
	cin >> A1;//вводим первую координату 
	cout << "B1" << endl;
	cin >> B1;//вводим вторую координату 
	cout << "B1" << endl;
	cin >> C1;//вводим третью координату 
	cout << "D1" << endl;
	cin >> D1;//вводим четвертую коордию 
	cout << "Введите координаты второй плоскости" << endl;//вывод второй плоскости
	cout << "A2" << endl;
	cin >> A2;//вводим первую координату 
	cout << "B2" << endl;
	cin >> B2;//вводим вторую координату 
	cout << "C2" << endl;
	cin >> C2;//вводим третью координату 
	cout << "D2" << endl;
	cin >> D2;//вводим четвертую коордию
	cout << "z0 = " << endl;//вывод z
	cin >> z0;//вводим z
	if (A1 == 0 && B1 == 0 && C1 == 0) cout << " Фигура не плоская ";// проверка на плоскость первой фигуры
	else if (A2 == 0 && B2 == 0 && C2 == 0) cout << " Фигура не плоская ";// Проверка на плоскость второй фигуры
	else if (A1 == 0 && A2 == 0 && B1 == 0 && B2 == 0) {
		if (C1 * D2 == C2 * D1) cout << "Совпадают ";
		else cout << "Параллельны ";
	}
	else if (B1 == 0 && B2 == 0 && C1 == 0 && C2 == 0) {
		if (A1 * D2 == A2 * D1) cout << "Совпадают ";
		else cout << "Параллельны ";
	}
	else if (A1 == 0 && A2 == 0 && C1 == 0 && C2 == 0) {
		if (B1 * D2 == B2 * D1) cout << "Совпадают ";
		else cout << "Параллельны ";
	}
	else if (A1 * B2 == A2 * B1 && A1 * C2 == A2 * C1 && A1 * D2 == A2 * D1 && B1 * C2 == B2 * C1 && B1 * D2 == B2 * D1 && C1 * D2 == C2 * D1) cout << " Фигуры совпадают ";// проверка на параллельность обоих фигур
	else if (A1 * B2 == A2 * B1 && A1 * C2 == A2 * C1 &&  B1 * C2 == B2 * C1) cout << " Фигуры параллельны ";//проверка на совпадение обоих фигур
	else// условие "иначе"
	{
		float C, c, A, B, e1, e, e2;// ввод переменных 
		C = A1 * B2 - A2 * B1;// находим сторону с 
		A = B1 * C2 - B2 * C1;// находим сторону а
		B = C1 * A2 - C2 * A1;//находим сторону b
		e1 = B1 * A2;
		e2 = -D1 * B2 - C1 * z0 * B2 - A1 * B2;
		e = e1 + e2;
		float x0 = (-B2 * (D1 + C1 * z0) + B1 * (D2 + C2 * z0)) / C;
		float y0 = (-A1 * (D2 + C2 * z0) + A2 * (D1 + C1 * z0)) / C;
		cout << x0 << endl;//вывод x0
		cout << y0 << endl;//вывод y0
		cout << A << endl;//вывод a
		cout << B << endl;// вывод b
		cout << C << endl;// вывод c

	}

	system("pause");// задержка консоли
	return 0;//оператор 2
}