#include <iostream>//библиотека дл€ потока ввода вывода
#include <cmath>//библиотека математических функций
using namespace std;//директива

int main()//оператор 1
{
	setlocale(LC_ALL, "RUS");//использование русской клавиатуры
	float S = 0, N, x, i, a, b;//объ€вл€ем переменные 
	cout << "¬ведите чисо N: ";//вывод н 
	cin >> N;//ввод н
	cout << "¬ведите х: ";//вывод х
	cin >> x;//ввод х
	for (float i = 1; i <= N; i++)//цикл 1
	{
		a = 1;//факториал
		for (b = 1; b <= i; b++)//цикл 2
		{
			a *= b;//факториал
		}
		S += (pow(-1, i - 1) * pow(x, 2 * i + 2) * a) / (pow(i,2) + i + 1);//формула
	}
	cout << "ќтвет S: " << S << endl;// вывод с
	system("pause");// задержка консоли
	return 0;// оператор 2
}
